espruino/Espruino/targets/esp32/BLE/esp32_gatts_func.c
/*
 * This file is part of Espruino, a JavaScript interpreter for Microcontrollers
 *
 * Copyright (C) 2017 Gordon Williams <gw@pur3.co.uk>
 *
 * This Source Code Form is subject to the terms of the Mozilla Public
 * License, v. 2.0. If a copy of the MPL was not distributed with this
 * file, You can obtain one at http://mozilla.org/MPL/2.0/.
 *
 * ----------------------------------------------------------------------------
 * ESP32 specific GATT functions
 * ----------------------------------------------------------------------------
 */

#include <stdio.h>

#include "esp_system.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "esp_gap_ble_api.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"

#include "BLE/esp32_gatts_func.h"
#include "BLE/esp32_gap_func.h"
#include "BLE/esp32_bluetooth_utils.h"

#include "bluetooth.h"
#include "bluetooth_utils.h"
#include "bluetooth_common.h"

#include "jsutils.h"
#include "jsparse.h"
#include "jsinteractive.h"
#include "jstimer.h"
#include "jswrap_bluetooth.h"

ble_uuid_t uart_service_uuid = {
  .type = BLE_UUID_TYPE_128,
  .uuid128 = {0x9e,0xca,0xdc,0x24,0x0e,0xe5,0xa9,0xe0,0x93,0xf3,0xa3,0xb5,0x01,0x00,0x40,0x6e}
};
esp_bt_uuid_t uart_char_rx_uuid = {
  .len = ESP_UUID_LEN_128,
  .uuid.uuid128 = {0x9e,0xca,0xdc,0x24,0x0e,0xe5,0xa9,0xe0,0x93,0xf3,0xa3,0xb5,0x02,0x00,0x40,0x6e}
};
esp_bt_uuid_t uart_char_tx_uuid = {
  .len = ESP_UUID_LEN_128,
  .uuid.uuid128 = {0x9e,0xca,0xdc,0x24,0x0e,0xe5,0xa9,0xe0,0x93,0xf3,0xa3,0xb5,0x03,0x00,0x40,0x6e}
};
esp_bt_uuid_t descriptor_uuid = {
  .len = ESP_UUID_LEN_16,
  .uuid.uuid16 = 0x2902
};

JsVar *gatts_services = 0;
uint8_t *adv_service_uuid128 = NULL;

uint16_t ble_service_pos = (uint16_t)-1;
uint16_t ble_service_cnt = 0;
uint16_t ble_char_pos = (uint16_t)-1;
uint16_t ble_char_cnt = 0;
uint16_t ble_descr_pos = (uint16_t)-1;
uint16_t ble_descr_cnt = 0;
uint16_t ble_mtu_len = 23;

/// gatts_service appears to carry information on the active BLE peripheral connection as well
struct gatts_service_inst *gatts_service = NULL;
struct gatts_char_inst *gatts_char = NULL;
struct gatts_descr_inst *gatts_descr = NULL;

bool _removeValues;
static volatile bool gatts_reset_in_progress = false;
static SemaphoreHandle_t gatts_reset_complete = NULL;

#define GATTS_RESET_TIMEOUT_MS 5000

void jshSetDeviceInitialised(IOEventFlags device, bool isInit);

int uart_gatts_service = -1;
uint16_t uart_tx_handle, uart_rx_handle;
bool uart_gatts_connected = false;

/// Bluetooth UART transmit data
uint8_t nusBuffer[ESP_GATT_MTU_SIZE];
/// Amount of characters ready to send in Bluetooth UART
volatile uint8_t nusBufferLen = 0;


/// Look up the characteristic's handle from the UUID. returns BLE_GATT_HANDLE_INVALID if not found
// NRF52 ver is in bluetooth_utils.c
uint16_t bleGetGATTHandle(ble_uuid_t char_uuid) {
  for(uint16_t pos = 0; pos < ble_char_cnt; pos++) {
    ble_uuid_t uuid;
    espbtuuid_TO_bleuuid(gatts_char[pos].char_uuid, &uuid);
    if (bleUUIDEqual(uuid, char_uuid)) {
       return gatts_char[pos].char_handle;
    }
  }
  return BLE_GATT_HANDLE_INVALID;
}


static void gatts_sendNUSNotification_txBuffer() {
  if(uart_gatts_service>=0) {
    /*esp_err_t err = */esp_ble_gatts_send_indicate(gatts_service[uart_gatts_service].gatts_if,0,uart_tx_handle,nusBufferLen,nusBuffer,false);
    // check error? resend if there was one? I think this just blocks if it can't send immediately
    // We can use ESP_GATTS_CONGEST_EVT: param->congest.congested = true will happen when we're sending too much, and we should
    // avoid sending any more. Then we'll get another one with congested = false
  }
  nusBufferLen = 0;
}
void gatts_sendNUSNotification(int c) {
  if(uart_gatts_service<0) return; // no service yet!

  int mtu = gatts_service[uart_gatts_service].mtu - 3;
  if (mtu > sizeof(nusBuffer)) mtu = sizeof(nusBuffer);

  if (nusBufferLen >= mtu)
    gatts_sendNUSNotification_txBuffer();
  // Add this character to our buffer
  nusBuffer[nusBufferLen] = (uint8_t)c;
  nusBufferLen++;
  // If our buffer is full, send right away
  if(nusBufferLen >= mtu) {
    gatts_sendNUSNotification_txBuffer();
  }
  // otherwise, we'll wait until we hit idle next time when gatts_sendNUSNotificationIfNotEmpty will get called
}
void gatts_sendNUSNotificationIfNotEmpty() {
  if (nusBufferLen)
    gatts_sendNUSNotification_txBuffer();
}

void emitNRFEvent(char *event,JsVar **args,unsigned int argCnt){
  JsVar *nrf = jsvObjectGetChildIfExists(execInfo.root, "NRF");
  if(!nrf) return; // No NRF object found - it hasn't been used yet but if not we're fine as there won't be anything to accept events!
  JsVar *eventName = jsvNewFromString(event);
  JsVar *callback = jsvSkipNameAndUnLock(jsvFindChildFromVar(nrf,eventName,0));
  jsvUnLock(eventName);
  if(callback) jsiQueueEvents(nrf,callback,args,(int)argCnt);
  jsvUnLock2(nrf, callback);
  if(args) jsvUnLockMany(argCnt,args);
}

int getIndexFromGatts_if(esp_gatt_if_t gatts_if){
  for(int i = 0; i < ble_service_cnt;i++){
    if(gatts_service[i].gatts_if == gatts_if) return i;
  }
  return -1;
}
// Is anything connected?
bool gatts_if_connected(){
  bool r = false;
  for(int i = 0; i < ble_service_cnt; i++){
    if(gatts_service[i].connected) r = true;
  }
  return r;
}
// Is any device connected to us? Ignore outgoing connections
bool gatts_if_periph_connected(){
  bool r = false;
  for(int i = 0; i < ble_service_cnt; i++){
    if(gatts_service[i].isPeripheral && gatts_service[i].connected) r = true;
  }
  return r;
}
uint16_t gatts_get_service_cnt() {
   return ble_service_cnt;
}

static void gatts_read_value_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  NOT_USED(event);
  esp_gatt_rsp_t rsp; JsVar *charValue;
  memset(&rsp, 0, sizeof(esp_gatt_rsp_t));
  rsp.attr_value.handle = param->read.handle;
  for (uint16_t pos=0;pos < ble_char_cnt;pos++) {
    if (gatts_char[pos].char_handle==param->read.handle) {
      char hiddenName[12];
      bleGetHiddenName(hiddenName,BLE_READ_EVENT,pos);
      JsVar *readCB = jsvObjectGetChildIfExists(execInfo.root,hiddenName);
      if(readCB){
        charValue = jspExecuteFunction(readCB,0,0,0);
        jsvUnLock(readCB);
      }
      else {
        char hiddenName[12];
        bleGetHiddenName(hiddenName,BLE_CHAR_VALUE,pos);
        charValue = jsvObjectGetChildIfExists(execInfo.hiddenRoot,hiddenName);
      }
      if(charValue){
        JSV_GET_AS_CHAR_ARRAY(vPtr,vLen,charValue);
        if (vPtr) {
          for(uint16_t valpos = 0; valpos < vLen; valpos++){
            rsp.attr_value.value[valpos] = vPtr[valpos];
          }
          rsp.attr_value.len = (uint16_t)vLen;
        }
        jsvUnLock(charValue);
      }
      break;
    }
  }
  for (uint32_t pos=0;pos < ble_descr_cnt;pos++) {
    if (gatts_descr[pos].descr_handle==param->read.handle) {
      memcpy(rsp.attr_value.value, gatts_descr[pos].value, gatts_descr[pos].len);
      rsp.attr_value.len = gatts_descr[pos].len;
      break;
    }
  }
  esp_ble_gatts_send_response(gatts_if, param->read.conn_id, param->read.trans_id, ESP_GATT_OK, &rsp);
}

// Called when something connects to us
static void gatts_connect_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  NOT_USED(event);
  int g = getIndexFromGatts_if(gatts_if);
  if (bleStatus & (BLE_ENCRYPT_UART | BLE_SECURITY_MITM))
    esp_ble_set_encryption(param->connect.remote_bda, ESP_BLE_SEC_ENCRYPT_MITM);
  if(g >= 0){
    gatts_service[g].conn_id = param->connect.conn_id;
    memcpy(gatts_service[g].bda, param->connect.remote_bda, ESP_BD_ADDR_LEN);
    gatts_service[g].connected = true;
    gatts_service[g].mtu = 23; // default
    // This is the only way it seems we can tell at this point if we're a peripheral or central.
    // ..if we were trying to connect to something else and we did, then we're a central.
    gatts_service[g].isPeripheral = !bleInTask(BLETASK_CONNECT);
    if (gatts_service[g].isPeripheral) {
      // If UART enabled, move to it
      if (!jsiIsConsoleDeviceForced() && (bleStatus & BLE_NUS_INITED)) {
        jsiClearInputLine(false); // clear the input line on connect
        jsiSetConsoleDevice(EV_BLUETOOTH, false);
      }

