espruino/Espruino/targets/esp32/BLE/esp32_gatts_func.c
      ble_gap_addr_t ble_addr;
      espbtaddr_TO_bleaddr(param->connect.remote_bda, 5/*force an unknown type so '' is reported*/, &ble_addr);
      JsVar *args[1];
      args[0] = bleAddrToStr(ble_addr);
      m_peripheral_conn_handle = 0x01;
      emitNRFEvent(BLE_CONNECT_EVENT,args,1); // TODO: it might be better to use the BLEP_CONNECTED handler
      if(gatts_service[g].serviceFlag == BLE_SERVICE_NUS) uart_gatts_connected = true;

      // request a connection params update to high speed (why not? ESP32 draws a bunch of power anyway)
      jsble_set_periph_connection_interval(7.5, 7.5);
      // FIXME: Use DYNAMIC_INTERVAL_ADJUSTMENT from nRF5x port to lower connection interval when idle
    }
  }
}
// Called when something disconnects from us
static void gatts_disconnect_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  NOT_USED(event);
  int g = getIndexFromGatts_if(gatts_if);
  esp_err_t r;
  if(g >= 0){
    gatts_service[g].connected = false;
    if (gatts_service[g].isPeripheral) {
      m_peripheral_conn_handle = BLE_CONN_HANDLE_INVALID;
      if(!gatts_if_periph_connected()){
        r = bluetooth_gap_startAdvertising(true);
      }
      // if we were on bluetooth and we disconnected, clear the input line so we're fresh next time (#2219)
      if (jsiGetConsoleDevice()==EV_BLUETOOTH) {
        jsiClearInputLine(false);
        if (!jsiIsConsoleDeviceForced())
          jsiSetConsoleDevice(jsiGetPreferredConsoleDevice(), 0);
      }
      // TODO: Maybe use BLEP_DISCONNECTED handler rather than doing this here?
      JsVar *args[1];
      args[0] = jsvNewFromInteger(param->disconnect.reason);
      emitNRFEvent(BLE_DISCONNECT_EVENT,args,1);
      if(gatts_service[g].serviceFlag == BLE_SERVICE_NUS) uart_gatts_connected = true;
    }
  }
}
void gatts_reg_app(){
  esp_err_t r;
  if(ble_service_pos < ble_service_cnt) {
    r = esp_ble_gatts_app_register(ble_service_pos);
    if(r) jsWarn("app_register error:%d\n",r);
  } else {
    bluetooth_gap_startAdvertising(true);
    jshSetDeviceInitialised(EV_BLUETOOTH, true);
  }
}
void gatts_createService(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  NOT_USED(event);
  esp_err_t r;
  gatts_service[param->reg.app_id].service_id.is_primary = true;
  gatts_service[param->reg.app_id].service_id.id.inst_id = 0x00;
  gatts_service[param->reg.app_id].gatts_if = gatts_if;
  bleuuid_TO_espbtuuid(gatts_service[param->reg.app_id].ble_uuid, &gatts_service[param->reg.app_id].service_id.id.uuid);
  r = esp_ble_gatts_create_service(gatts_if, &gatts_service[param->reg.app_id].service_id, gatts_service[param->reg.app_id].num_handles);
  if(r) jsWarn("createService error:%d\n",r);
  // update out UART service if this was the one
  if(gatts_service[param->reg.app_id].serviceFlag == BLE_SERVICE_NUS){
    uart_gatts_service = param->reg.app_id;
  }
}
void gatts_add_char(){
  esp_err_t r;
  for(uint16_t pos=0; pos < ble_char_cnt; pos++){
    if(gatts_char[pos].service_pos == ble_service_pos && gatts_char[pos].char_handle == 0){
      ble_char_pos = pos;
      r = esp_ble_gatts_add_char(gatts_service[ble_service_pos].service_handle, &gatts_char[pos].char_uuid,
        gatts_char[pos].char_perm, gatts_char[pos].char_property,
        NULL, gatts_char[pos].char_control);
      if(r) jsWarn("add char error:%d\n",r);
      return;
    }
  }
  ble_service_pos++;
  gatts_reg_app();
}
void gatts_add_descr(){
  esp_err_t r;
  for(uint16_t pos = 0;pos < ble_descr_cnt; pos++){
    if(gatts_descr[pos].descr_handle == 0 && gatts_descr[pos].char_pos == ble_char_pos){
    ble_descr_pos = pos;
      r = esp_ble_gatts_add_char_descr(gatts_service[ble_service_pos].service_handle,
      &gatts_descr[pos].descr_uuid,gatts_descr[pos].descr_perm,
      NULL,gatts_descr[pos].descr_control);
      if(r) jsWarn("add descr error:%d\n",r);
      return;
    }
  }
  ble_char_pos++;
  gatts_add_char();
}
void gatts_check_add_descr(esp_bt_uuid_t descr_uuid, uint16_t attr_handle){
  NOT_USED(descr_uuid);
  if(attr_handle != 0){
    gatts_descr[ble_descr_pos].descr_handle=attr_handle;
  }
  gatts_add_descr(); // try to add more descriptors
}
static void gatts_check_add_char(esp_bt_uuid_t char_uuid, uint16_t attr_handle) {
  NOT_USED(char_uuid);
  if (attr_handle != 0) {
    gatts_char[ble_char_pos].char_handle = attr_handle;
    if (gatts_char[ble_char_pos].charFlag == BLE_CHAR_UART_TX)
      uart_tx_handle = attr_handle;
    if (gatts_char[ble_char_pos].charFlag == BLE_CHAR_UART_RX)
      uart_rx_handle = attr_handle;
    gatts_add_descr(); // try to add descriptors to this characteristic
  }
}
static void gatts_delete_service(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if){
  NOT_USED(event);
  int serviceIndex = getIndexFromGatts_if(gatts_if);
  if (serviceIndex < 0) {
    jsWarn("delete event for unknown gatts_if:%d", gatts_if);
    return;
  }
  esp_err_t r = esp_ble_gatts_app_unregister(gatts_service[serviceIndex].gatts_if);
  if(r) jsWarn("error in app_unregister:%d\n",r);
}
static void gatts_unreg_app(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if){
  NOT_USED(event);
  int serviceIndex = getIndexFromGatts_if(gatts_if);
  if (serviceIndex < 0) {
    jsWarn("unregister event for unknown gatts_if:%d", gatts_if);
    return;
  }
  gatts_service[serviceIndex].gatts_if = ESP_GATT_IF_NONE;
  for(int i = 0; i < ble_service_cnt; i++){
    if(gatts_service[i].gatts_if != ESP_GATT_IF_NONE) return;
  }
  free(adv_service_uuid128);adv_service_uuid128 = NULL;
  free(gatts_char);gatts_char = NULL;
  free(gatts_descr);gatts_descr = NULL;
  free(gatts_service);gatts_service = NULL;
  ble_service_cnt = 0;
  ble_char_cnt = 0;
  ble_descr_cnt = 0;
  if(_removeValues) bleRemoveChilds(execInfo.hiddenRoot);
  gatts_reset_in_progress = false;
  if (gatts_reset_complete) xSemaphoreGive(gatts_reset_complete);
}

// Update our hidden var with the right value
void gatts_set_char_value(uint16_t handle, char *data, int len) {
  for(uint16_t pos = 0; pos < ble_char_cnt; pos++){
    if (gatts_char[pos].char_handle == handle){
      char hiddenName[12];
      bleGetHiddenName(hiddenName,BLE_CHAR_VALUE,pos);
      jsvObjectSetChildAndUnLock(execInfo.hiddenRoot,hiddenName,jsvNewStringOfLength((unsigned int)len, data));
    }
  }
}

void gatts_event_handler(esp_gatts_cb_event_t event, esp_gatt_if_t gatts_if, esp_ble_gatts_cb_param_t *param) {
  jsWarnGattsEvent(event,gatts_if);
  switch (event) {
  case ESP_GATTS_REG_EVT:{
    gatts_createService(event,gatts_if,param);
    break;
  }
  case ESP_GATTS_CREATE_EVT:{
    gatts_service[ble_service_pos].service_handle = param->create.service_handle;
    esp_ble_gatts_start_service(gatts_service[ble_service_pos].service_handle);
    break;
  }
  case ESP_GATTS_ADD_CHAR_EVT: {
    if (param->add_char.status==ESP_GATT_OK) {
      gatts_check_add_char(param->add_char.char_uuid,param->add_char.attr_handle);
    } else {
      jsWarn("add char failed:%d\n",param->add_char.status);
      gatts_char[ble_char_pos].char_handle = (uint16_t)-1;
      ble_char_pos++;
      gatts_add_char();
    }
    break;
  }
  case ESP_GATTS_START_EVT: {gatts_add_char();break;}
  case ESP_GATTS_DISCONNECT_EVT:{gatts_disconnect_handler(event,gatts_if,param); break;}
  case ESP_GATTS_ADD_CHAR_DESCR_EVT:{
    if (param->add_char_descr.status==ESP_GATT_OK) {
      gatts_check_add_descr(param->add_char.char_uuid,param->add_char.attr_handle);
    }
    else{jsWarn("add descr failed:%d\n",param->add_char_descr.status);}
    break;
  }
  case ESP_GATTS_CONNECT_EVT: {gatts_connect_handler(event,gatts_if,param); break;}
  case ESP_GATTS_READ_EVT: {gatts_read_value_handler(event, gatts_if, param);break;}
  case ESP_GATTS_WRITE_EVT:{
    if(gatts_service[getIndexFromGatts_if(gatts_if)].serviceFlag == BLE_SERVICE_NUS) { // UART service
      if (param->write.handle == uart_rx_handle) { // we could have been writing to the TX CCCD to enable notifications
        jshPushIOCharEvents(EV_BLUETOOTH, (char*)param->write.value, param->write.len);
        jshHadEvent();
      }
    } else { // a normal write
      // Update our hidden var with the right value (this is not great to do from an IRQ)
      gatts_set_char_value(param->write.handle, (char*)param->write.value, param->write.len);
      // queue the event execution if we have a handler
      for(uint16_t pos = 0; pos < ble_char_cnt; pos++){
        if(gatts_char[pos].char_handle == param->write.handle){ // onWrite
          jsble_queue_pending_buf(BLEP_WRITE, pos, (char*)param->write.value, param->write.len);
        }
      }
      for(uint16_t pos = 0; pos < ble_descr_cnt; pos++){
        if(gatts_descr[pos].descr_handle == param->write.handle){ // onWriteDesc
          // jsble_queue_pending_buf(BLEP_WRITE, pos, (char*)param->write.value, param->write.len); // can't send 'pos' as it's meant as an index in gatts_char not gatts_descr
          gatts_descr[pos].len = param->write.len;
          if (gatts_descr[pos].len > sizeof(gatts_descr[pos].value))
            gatts_descr[pos].len = sizeof(gatts_descr[pos].value);
          memcpy(gatts_descr[pos].value, param->write.value, gatts_descr[pos].len);
        }
      }
    }
    jsble_peripheral_activity(); // flag that we've been busy
    esp_ble_gatts_send_response(gatts_if, param->write.conn_id, param->write.trans_id, ESP_GATT_OK, NULL);
    break;
  }
  case ESP_GATTS_DELETE_EVT:{gatts_delete_service(event,gatts_if);break;}
  case ESP_GATTS_UNREG_EVT:{gatts_unreg_app(event,gatts_if);break;}

  case ESP_GATTS_EXEC_WRITE_EVT:break;
  case ESP_GATTS_MTU_EVT: {
    int g = getIndexFromGatts_if(gatts_if);
    uint16_t effective_mtu = param->mtu.mtu;
    if (g>=0) gatts_service[g].mtu = effective_mtu;
    //jsble_queue_pending_buf(BLEP_MTU_UPDATE, g, (char*)effective_mtu, sizeof(effective_mtu)); // need to move BLEP_MTU_UPDATE from nRF52 into global
  } break;
  case ESP_GATTS_CONF_EVT: // if (gatts_if==gatts_service[uart_gatts_service].gatts_if) UART indicate TX has finished
    break;
  case ESP_GATTS_ADD_INCL_SRVC_EVT:break;
  case ESP_GATTS_STOP_EVT: // service stopped via gatts_reset - we need to remove it now
    if (param->stop.status == ESP_GATT_OK) {
      // Safe to delete now that it's no longer active
      esp_ble_gatts_delete_service(param->stop.service_handle);
    } else {
      jsWarn("ESP_GATTS_STOP_EVT: Stop service failed, status %d", param->stop.status);
      // Ensure a failed stop cannot leave a pending service replacement stuck.
      esp_err_t r = esp_ble_gatts_app_unregister(gatts_if);
      if (r) jsWarn("error in app_unregister after stop failure:%d", r);
    }
    break;
  case ESP_GATTS_OPEN_EVT:break;
  case ESP_GATTS_CANCEL_OPEN_EVT:break;
  case ESP_GATTS_CLOSE_EVT:break;
  case ESP_GATTS_LISTEN_EVT:break;
  case ESP_GATTS_CONGEST_EVT:break;
  default:
    break;
  }
}

void add_ble_uart(){
  int handles = 1;
  esp_gatt_perm_t read_perm = ESP_GATT_PERM_READ,
                  write_perm = ESP_GATT_PERM_WRITE;
  if (bleStatus & BLE_ENCRYPT_UART) {
    read_perm = ESP_GATT_PERM_READ_ENCRYPTED;// or ENC_MITM to require MITM protection?
    write_perm = ESP_GATT_PERM_WRITE_ENCRYPTED;// or ENC_MITM to require MITM protection?
  }
  ble_service_pos++;
  gatts_service[ble_service_pos].ble_uuid = uart_service_uuid;
  bleuuid_To_uuid128(gatts_service[ble_service_pos].ble_uuid,&adv_service_uuid128[ble_service_pos * 16]);
  gatts_service[ble_service_pos].uuid16 = gatts_service[ble_service_pos].ble_uuid.uuid;
  gatts_service[ble_service_pos].serviceFlag = BLE_SERVICE_NUS;
  gatts_service[ble_service_pos].gatts_if = ESP_GATT_IF_NONE;
  ble_char_pos++;
  gatts_char[ble_char_pos].service_pos = ble_service_pos;
  gatts_char[ble_char_pos].char_uuid = uart_char_rx_uuid;
  gatts_char[ble_char_pos].char_perm = write_perm;
  gatts_char[ble_char_pos].char_property |= ESP_GATT_CHAR_PROP_BIT_WRITE|ESP_GATT_CHAR_PROP_BIT_WRITE_NR;
  gatts_char[ble_char_pos].char_control = NULL;
  gatts_char[ble_char_pos].char_handle = 0;
  gatts_char[ble_char_pos].charFlag = BLE_CHAR_UART_RX;
  handles +=2;
  ble_char_pos++;
  gatts_char[ble_char_pos].service_pos = ble_service_pos;
  gatts_char[ble_char_pos].char_uuid = uart_char_tx_uuid;
  gatts_char[ble_char_pos].char_perm = read_perm;
  gatts_char[ble_char_pos].char_property |= ESP_GATT_CHAR_PROP_BIT_NOTIFY;
  gatts_char[ble_char_pos].char_control = NULL;
  gatts_char[ble_char_pos].char_handle = 0;
  gatts_char[ble_char_pos].charFlag = BLE_CHAR_UART_TX;
  handles +=2;
  ble_descr_pos++;
  gatts_descr[ble_descr_pos].char_pos = ble_char_pos;
  gatts_descr[ble_descr_pos].descr_uuid = descriptor_uuid;
  gatts_descr[ble_descr_pos].descr_handle = 0;
  gatts_descr[ble_descr_pos].descr_perm = read_perm | write_perm;
  gatts_descr[ble_descr_pos].len = 2;
  handles +=2;
  gatts_service[ble_service_pos].num_handles = (uint16_t)handles;
}

void gatts_char_init(JsvObjectIterator *ble_char_it){
  const char *errorStr;
  ble_uuid_t ble_uuid;
  gatts_char[ble_char_pos].service_pos = ble_service_pos;
  if((errorStr = bleVarToUUIDAndUnLock(&ble_uuid,jsvObjectIteratorGetKey(ble_char_it)))){
    jsExceptionHere(JSET_ERROR,"invalid Char UUID:%s",errorStr);
  }
  // WARNING: Descriptors/chars this allocates must match gatts_create_structs exactly!
  JsVar *charVar = jsvObjectIteratorGetValue(ble_char_it);
  gatts_char[ble_char_pos].char_uuid.len = ESP_UUID_LEN_16;
  gatts_char[ble_char_pos].char_uuid.uuid.uuid16 = ble_uuid.uuid;
  gatts_char[ble_char_pos].char_perm = 0;
  if (jsvObjectGetBoolChild(charVar, "broadcast"))
    gatts_char[ble_char_pos].char_property |= ESP_GATT_CHAR_PROP_BIT_BROADCAST;
  if (jsvObjectGetBoolChild(charVar, "notify"))
    gatts_char[ble_char_pos].char_property |= ESP_GATT_CHAR_PROP_BIT_NOTIFY;
  if (jsvObjectGetBoolChild(charVar, "indicate"))
    gatts_char[ble_char_pos].char_property |= ESP_GATT_CHAR_PROP_BIT_INDICATE;
  if (jsvObjectGetBoolChild(charVar, "readable")){
    gatts_char[ble_char_pos].char_perm |= ESP_GATT_PERM_READ;
    gatts_char[ble_char_pos].char_property |= ESP_GATT_CHAR_PROP_BIT_READ;
  }
  if (jsvObjectGetBoolChild(charVar, "writable")){
    gatts_char[ble_char_pos].char_perm |= ESP_GATT_PERM_WRITE;
    gatts_char[ble_char_pos].char_property |= ESP_GATT_CHAR_PROP_BIT_WRITE|ESP_GATT_CHAR_PROP_BIT_WRITE_NR;
  }
  gatts_char[ble_char_pos].char_control = NULL;
  gatts_char[ble_char_pos].char_handle = 0;
  JsVar *readCB = jsvObjectGetChildIfExists(charVar, "onRead"); // non-documented, not in nRF52
  if(readCB){
    char hiddenName[12];
    bleGetHiddenName(hiddenName,BLE_READ_EVENT,ble_char_pos);
    jsvObjectSetChildAndUnLock(execInfo.root,hiddenName,readCB);
  }
  JsVar *writeCB = jsvObjectGetChildIfExists(charVar, "onWrite");
  if(writeCB){
    char hiddenName[12];
    bleGetWriteEventName(hiddenName,ble_char_pos);
    jsvObjectSetChildAndUnLock(execInfo.root,hiddenName,writeCB);
  }
  // notify/indicate need a descriptor to work
  if (jsvObjectGetBoolChild(charVar, "notify") || jsvObjectGetBoolChild(charVar, "indicate")) {
    ble_descr_pos++;
    assert(ble_descr_pos < ble_descr_cnt);
    gatts_descr[ble_descr_pos].char_pos = ble_char_pos;
    gatts_descr[ble_descr_pos].descr_uuid = descriptor_uuid;
    gatts_descr[ble_descr_pos].descr_handle = 0;
    gatts_descr[ble_descr_pos].descr_perm = ESP_GATT_PERM_READ | ESP_GATT_PERM_WRITE;
    gatts_descr[ble_descr_pos].len = 2;
  }
  JsVar *charDescriptionVar = jsvObjectGetChildIfExists(charVar, "description");
  if (charDescriptionVar && jsvHasCharacterData(charDescriptionVar)) {
    ble_descr_pos++;
    assert(ble_descr_pos < ble_descr_cnt);
    gatts_descr[ble_descr_pos].char_pos = ble_char_pos;
    gatts_descr[ble_descr_pos].descr_uuid.len = ESP_UUID_LEN_16;
    gatts_descr[ble_descr_pos].descr_uuid.uuid.uuid16 = ESP_GATT_UUID_CHAR_DESCRIPTION;
    gatts_descr[ble_descr_pos].descr_perm = ESP_GATT_PERM_READ;
    gatts_descr[ble_descr_pos].len =
      jsvGetString(charDescriptionVar, (char*)gatts_descr[ble_descr_pos].value, sizeof(gatts_descr[ble_descr_pos].value));
    gatts_descr[ble_descr_pos].descr_control = NULL;
    gatts_descr[ble_descr_pos].descr_handle = 0;
  }
  jsvUnLock(charDescriptionVar);

  JsVar *charValue = jsvObjectGetChildIfExists(charVar,"value");
  if(charValue){
    char hiddenName[12];
    bleGetHiddenName(hiddenName,BLE_CHAR_VALUE,ble_char_pos);
    jsvObjectSetChildAndUnLock(execInfo.hiddenRoot,hiddenName,charValue);
  }
  jsvUnLock(charVar);
}
void gatts_service_struct_init(JsvObjectIterator *ble_service_it){
  ble_uuid_t ble_uuid;
  int handles;
  const char *errorStr;
  if((errorStr = bleVarToUUIDAndUnLock(&gatts_service[ble_service_pos].ble_uuid, jsvObjectIteratorGetKey(ble_service_it)))){
    jsExceptionHere(JSET_ERROR,"Invalid Service UUID: %s",errorStr);
  }
  handles = 1; //for service
  bleuuid_To_uuid128(gatts_service[ble_service_pos].ble_uuid,&adv_service_uuid128[ble_service_pos * 16]);
  gatts_service[ble_service_pos].uuid16 = gatts_service[ble_service_pos].ble_uuid.uuid;
  JsVar *serviceVar = jsvObjectIteratorGetValue(ble_service_it);
  JsvObjectIterator ble_char_it;
  jsvObjectIteratorNew(&ble_char_it,serviceVar);
  while(jsvObjectIteratorHasValue(&ble_char_it)){
    ble_char_pos++;
    gatts_char_init(&ble_char_it);
      handles +=2; //2 for each char
    handles +=2; //placeholder for 2 descr
    jsvObjectIteratorNext(&ble_char_it);
  }
  gatts_service[ble_service_pos].num_handles = (uint16_t)handles;
  jsvObjectIteratorFree(&ble_char_it);
  jsvUnLock(serviceVar);
}
void gatts_structs_init(bool enableUART){
  for(int i = 0; i < ble_service_cnt; i++){
    gatts_service[i].gatts_if = ESP_GATT_IF_NONE;
    gatts_service[i].num_handles = 0;
    gatts_service[i].serviceFlag = BLE_SERVICE_GENERAL;
    gatts_service[i].connected = false;
  }
  for(int i = 0; i < ble_char_cnt;i++){
    gatts_char[i].service_pos = (uint16_t)-1;
    gatts_char[i].charFlag = BLE_CHAR_GENERAL;
  }
  for(int i = 0; i < ble_descr_cnt;i++){
    gatts_descr[i].char_pos = (uint16_t)-1;
  }
  if (gatts_services) {
    JsvObjectIterator ble_service_it;
    jsvObjectIteratorNew(&ble_service_it, gatts_services);
    while(jsvObjectIteratorHasValue(&ble_service_it)){
      ble_service_pos++;
      gatts_service_struct_init(&ble_service_it);
      jsvObjectIteratorNext(&ble_service_it);
    }
    jsvObjectIteratorFree(&ble_service_it);
  }
  if (enableUART) {
    add_ble_uart();
  }
}

