espruino/Espruino/targets/esp32/BLE/esp32_gatts_func.c
// Actually allocates gatts_services with enough space
void gatts_create_structs(bool enableUART){
  ble_service_cnt = 0; ble_char_cnt = 0; ble_descr_cnt = 0;
  ble_service_pos = (uint16_t)-1; ble_char_pos = (uint16_t)-1; ble_descr_pos = (uint16_t)-1;
  if (gatts_services) {
    JsvObjectIterator ble_service_it;
    jsvObjectIteratorNew(&ble_service_it,gatts_services);
    while(jsvObjectIteratorHasValue(&ble_service_it)){
      JsVar *serviceVar = jsvObjectIteratorGetValue(&ble_service_it);
      JsvObjectIterator ble_char_it;
      jsvObjectIteratorNew(&ble_char_it,serviceVar);
      while(jsvObjectIteratorHasValue(&ble_char_it)){
        // WARNING: Descriptors/chars this allocates must match gatts_char_init exactly!
        JsVar *charVar = jsvObjectIteratorGetValue(&ble_char_it);
        if (jsvObjectGetBoolChild(charVar, "notify") || jsvObjectGetBoolChild(charVar, "indicate"))
          ble_descr_cnt++;
        JsVar *charDescriptionVar = jsvObjectGetChildIfExists(charVar, "description");
        if (charDescriptionVar && jsvHasCharacterData(charDescriptionVar)) ble_descr_cnt++;
        jsvUnLock2(charDescriptionVar, charVar);
        jsvObjectIteratorNext(&ble_char_it);
        ble_char_cnt++;
      }
      jsvUnLock(serviceVar);
      jsvObjectIteratorFree(&ble_char_it);
      jsvObjectIteratorNext(&ble_service_it);
      ble_service_cnt++;
    }
    jsvObjectIteratorFree(&ble_service_it);
  }
  if (enableUART) {
    ble_service_cnt++;
    ble_char_cnt += 2;
    ble_descr_cnt += 2;
  }
  adv_service_uuid128 = calloc(sizeof(uint8_t),(ble_service_cnt * 16));
  gatts_service = calloc(sizeof(struct gatts_service_inst),ble_service_cnt);
  gatts_char = calloc(sizeof(struct gatts_char_inst),ble_char_cnt);
  gatts_descr = calloc(sizeof(struct gatts_descr_inst),ble_descr_cnt);
}

void gatts_set_services(JsVar *data){
  JsVar *options = jsvObjectGetChildIfExists(execInfo.hiddenRoot, BLE_NAME_SERVICE_OPTIONS);
  if (ble_service_cnt > 0) {
    if (!gatts_reset_complete)
      gatts_reset_complete = xSemaphoreCreateBinary();
    if (!gatts_reset_complete) {
      jsWarn("Unable to allocate GATT reset semaphore");
      jsvUnLock(options);
      return;
    }
    // Discard a completion left by an earlier reset before starting this one.
    while (xSemaphoreTake(gatts_reset_complete, 0) == pdTRUE) {}
    gatts_reset(true);
    if (gatts_reset_in_progress &&
        xSemaphoreTake(gatts_reset_complete, pdMS_TO_TICKS(GATTS_RESET_TIMEOUT_MS)) != pdTRUE) {
      jsWarn("Timed out waiting for GATT services to reset");
      jsvUnLock(options);
      return;
    }
  }
  jsvUnLock(gatts_services);
  gatts_services = data ? jsvLockAgain(data) : NULL;
  uart_gatts_service = -1;
  uart_tx_handle = 0;

  JsVar *uartVar = jsvObjectGetChildIfExists(execInfo.hiddenRoot, BLE_NAME_NUS);
  bool enableUART = !uartVar || jsvGetBool(uartVar); // if not set, default is enabled
  jsvUnLock(uartVar);
  // set the flags correctly
  if (enableUART) {
    bleStatus |= BLE_NUS_INITED;
  } else {
    bleStatus &= ~BLE_NUS_INITED;
  }
  gatts_create_structs(enableUART); //  allocate gatts_services with enough space
  gatts_structs_init(enableUART); // fill in gatts_services
  ble_service_pos = 0;
  ble_char_pos = 0;
  ble_descr_pos = 0;
  gatts_reg_app();  //this starts tons of api calls creating gatts-events. Ends in gatts_reg_app
  jsvUnLock(options);
}
void gatts_reset(bool removeValues){
  if (!removeValues && gatts_if_connected()) {
    jsWarn("Not removing services for reset() as connected");
    return;
  }
  if (gatts_reset_in_progress) {
    _removeValues |= removeValues;
    return;
  }
  esp_err_t r;
  _removeValues = removeValues;
  if (ble_service_cnt > 0) { // FIXME: why are we removing even if removeValues=false?
    int activeServices = 0;
    for (int i = 0; i < ble_service_cnt; i++) {
      if (gatts_service[i].gatts_if != ESP_GATT_IF_NONE) activeServices++;
    }
    gatts_reset_in_progress = activeServices > 0;
    for(int i = 0; i < ble_service_cnt;i++){
      if(gatts_service[i].gatts_if != ESP_GATT_IF_NONE){
        r = esp_ble_gatts_stop_service(gatts_service[i].service_handle);
        if (r) {
          jsWarn("stop service error:%d\n",r);
          r = esp_ble_gatts_app_unregister(gatts_service[i].gatts_if);
          if (r) jsWarn("app_unregister after stop error:%d\n", r);
        }
        // ESP_GATTS_STOP_EVT should now be fired, and we do esp_ble_gatts_delete_service in there
      }
    }
  }
}
// called from NRF.updateServices
void gatts_update_service(uint16_t char_handle, char *data, int len, bool isNotify, bool isIndicate){
  gatts_set_char_value(char_handle, data, len);
  if (isNotify || isIndicate) {
    for(uint16_t pos = 0; pos < ble_char_cnt; pos++){
      if (gatts_char[pos].char_handle == char_handle) {
        esp_err_t err = esp_ble_gatts_send_indicate(
          gatts_service[gatts_char[pos].service_pos].gatts_if,
          gatts_service[gatts_char[pos].service_pos].conn_id, // connection ID
          char_handle,
          len,data,isIndicate /* false = notify */);
        if (err) jsiConsolePrintf("NRF.updateServices esp_ble_gatts_send_indicate failed with %d\n", err);
      }
    }
  }
}

/** Set the connection interval of the peripheral connection. Returns an error code. */
uint32_t jsble_set_periph_connection_interval(JsVarFloat min, JsVarFloat max) {
  esp_ble_conn_update_params_t conn_params = {0};

  // Define your desired timing bounds (Multiples of 1.25ms)
  conn_params.min_int = (int)(0.5 + (min/1.25));  // 1.25ms units
  conn_params.max_int = (int)(0.5 + (max/1.25));  // 1.25ms units

  conn_params.latency = 0;   // Number of connection events the peripheral can skip
  conn_params.timeout = 400; // 400 * 10ms = 4000ms (Link loss timeout)

  // Send the update request to the Central
  for(int i = 0; i < ble_service_cnt;i++) {
    if(gatts_service[i].connected) {
      memcpy(conn_params.bda, gatts_service[i].bda, ESP_BD_ADDR_LEN);
      esp_ble_gap_update_conn_params(&conn_params);
    }
  }
}
